/*
  Види зв'язків сутностей у БД:

    1 : 1 - один до одного 
      ( у 1 країни є 1 прапор, у 1 прапора 1 країна )
      ( 1 користувачу відповідає 1 запис даних куристувача, 1 запис кори стувача налехить 1 користувачу)
    
    1 : m - один до багатох
      (в одній групі багато студентів, у 1 студента буде 1 група)
      (у книжки один автор, у автора книжок багато)

    n : m - багато до багатьох
      (в одному чаті багато людей, конкретний користувач теж має багато чатів)
      (в обному замовленні може бути багато товарів, товар може знаходитися в багатьох замовленнях)

    По жорсткості зв'язку (по обов'язковості)
      Жорсткі - запис обо'вязково пов'язаний з записом у іншій таблиці (1)
      Нежорсткі - запис необо'вязково пов'язаний з записом у іншій таблиці (0)

    По кількості таблиць у зв'язку:
      унарні звязки (запис з таблиці посилається на інший запис з цієї ж таблиці)
      бінарний зв'язок (дві даблиці у зв'язку)
      тернарний зв'язок
      ...
*/